<template>
  <div
    class="comments-wrapper"
    v-show="isShowComments">
    <!-- this is Comments -->
    <ClientOnly>
      <!-- <component
        :is="componentName"
        :options="options" /> -->
    </ClientOnly>
  </div>
</template>

<script>
export default {
  props: {
    commentsData: {
      type: Array,
      default: () => []
    }
  },
  data () {
    return {
      emojiList: ['😀', '😁', '😂', '😃', '😄', '😅', '😆', '😉', '😊', '😋', '😎', '😍', '😘', '😗', '😚', '😙', '😇', '😐', '😑', '😶', '😏', '😣', '😥', '😮', '😯', '😪', '😫', '😴', '😌', '😛', '😜', '😝', '😒', '😓', '😔', '😕', '😲', '😷', '😖', '😞', '😟', '😤', '😢', '😭', '😦', '😧', '😨', '😬', '😰', '😱', '😳', '😵', '😡', '😠', '😭', '😢', '😔', '😱', '😌', '💛', '🙂', '😒', '😜', '👍︎', '👏', '💪', '👌', '❤️', '💕']
    }
  },
  watch: {
    '$route': (to, from) => {

    }
  }
}
</script>
