<template>
  <div class="text-area">
    <!-- spellcheck -->
    <textarea v-model="value" autocomplete maxlength="200" placeholder="支持markdown渲染" rows="10" class="rich-text"></textarea>
  </div>
</template>

<script>
export default {
  data() {
    return {
      value: '',
      emojiList: ['😀', '😁', '😂', '😃', '😄', '😅', '😆', '😉', '😊', '😋', '😎', '😍', '😘', '😗', '😚', '😙', '😇', '😐', '😑', '😶', '😏', '😣', '😥', '😮', '😯', '😪', '😫', '😴', '😌', '😛', '😜', '😝', '😒', '😓', '😔', '😕', '😲', '😷', '😖', '😞', '😟', '😤', '😢', '😭', '😦', '😧', '😨', '😬', '😰', '😱', '😳', '😵', '😡', '😠', '😭', '😢', '😔', '😱', '😌', '💛', '🙂', '😒', '😜', '👍︎', '👏', '💪', '👌', '❤️', '💕']
    }
  }
}
</script>

<style scoped lang='stylus'>
.rich-text 
  width 100%
  box-sizing border-box
  padding 0.5rem

</style>